(function(){
  var date  = new Date();

  var numb  = date.getUTCDate();//day number
  var month = date.getMonth();//month number
  var day   = date.getDay();//day number 0-6

  var days = [ //xīngqí qī
    ["Воскресенье","星期日","xīng qí rì"],//sunday
    ["Понедельник","星期一","xīng qí yī"],//monday
    ["Вторник","星期二","xīng qí èr"],    //tuesday
    ["Среда","星期三","xīng qí sān"],      //wednesday
    ["Четверг","星期四","xīng qí sì"],    //thursday
    ["Пятница","星期五","xīng qí wǔ"],    //friday
    ["Суббота","星期六","xīng qí liù"]     //saturday
  ];

  var months = [
    ["январь","一月","yī yuè"],
    ["февраль","二月","èr yuè"],
    ["март","三月","sān yuè"],
    ["апрель","四月","sì yuè"],
    ["май","五月","wǔ yuè"],
    ["июнь","六月","liù yuè"],
    ["июль","七月","qī yuè"],
    ["август","八月","bā yuè"],
    ["сентябрь","九月","jiǔ yuè"],
    ["октябрь","十月","shí yuè"],
    ["ноябрь","十一月","shí yī yuè"],
    ["декабрь","十二月","shí èr yuè"]
  ];

  var numbers = [ //ое
    ["первое","一","yī"],
    ["второе","二","èr"],
    ["третье","三","sān"],
    ["четвёртое","四","sì"],
    ["пятое","五","wǔ"],
    ["шестое","六","liù"],
    ["седьмое","七","qī"],
    ["восемое","八","bā"],
    ["девятое","九","jiǔ"],
    ["десятое","十","shí"],
    ["одиннадцатое","十一","shí"],
    ["двенадцатое","十二","shí"],
    ["тринадцатое","十三","shí"],
    ["четырнадцатое","十四","shí"],
    ["пятьнадцатое","十五","shí"],
    ["шестнадцатое","十六","shí"],
    ["семнадцатое","十七","shí"],
    ["восемнадцатое","十八","shí"],
    ["девятнадцатое","十九","shí"],
    ["двадцать","二十","shí"],
    ["двадцать один","二十一","shí"],
    ["двадцать два","二十二","shí"],
    ["двадцать три","二十三","shí"],
    ["двадцать четыре","二十四","shí"],
    ["двадцать пять","二十五","shí"],
    ["двадцать шесть","二十七","shí"],
    ["двадцать семь","二十七","shí"],
    ["двадцать восемь","二十八","shí"],
    ["двадцать девять","二十九","shí"],
    ["тридцать","三十","shí"],
    ["тридцать один","三十一","shí"]
  ];

  document.getElementById('russian').innerHTML = days[day][0]+" "+numbers[numb][0]+" "+months[month][0];
  document.getElementById('chinese').innerHTML = months[month][1]+numbers[numb][1]+"日"+days[day][1];
  document.getElementById('pinyin').innerHTML = months[month][2]+" "+numbers[numb][2]+" rì "+days[day][2];
  document.getElementById('date').innerHTML = numb+"/"+(month+1)+"/2017";
})();
