//(function(){
  var date  = new Date();

  var numb  = date.getUTCDate();//day number
  var month = date.getMonth();//month number
  var day   = date.getDay();//day number 0-6

  console.log(numb);
  console.log(month);
  console.log(day);

  var days = [
    ["Воскресенье","星期日"],//sunday
    ["Понедельник","星期一"],//monday
    ["Вторник","星期二"],    //tuesday
    ["Среда","星期三"],      //wednesday
    ["Четверг","星期四"],    //thursday
    ["Пятница","星期五"],    //friday
    ["Суббота","星期六"]     //saturday
  ];

  var months = [
    ["январь","一月"],
    ["февраль","二月"],
    ["март","三月"],
    ["апрель","四月"],
    ["май","五月"],
    ["июнь","六月"],
    ["июль","七月"],
    ["август","八月"],
    ["сентябрь","九月"],
    ["октябрь","十月"],
    ["ноябрь","十一月"],
    ["декабрь","十二月"]
  ];

  var numbers = [ //ое
    ["первое","一"],
    ["второе","二"],
    ["третье","三"],
    ["четвёртое","四"],
    ["пятое","五"],
    ["шестое","六"],
    ["седьмое","七"],
    ["восемое","八"],
    ["девятое","九"],
    ["десятое","十"],
    ["одиннадцатое","十一"],
    ["двенадцатое","十二"],
    ["тринадцатое","十三"],
    ["четырнадцатое","十四"],
    ["пятьнадцатое","十五"],
    ["шестнадцатое","十六"],
    ["семнадцатое","十七"],
    ["восемнадцатое","十八"],
    ["девятнадцатое","十九"],
    ["двадцать","二十"],
    ["двадцать один","二十一"],
    ["двадцать два","二十二"],
    ["двадцать три","二十三"],
    ["двадцать четыре","二十四"],
    ["двадцать пять","二十五"],
    ["двадцать шесть","二十七"],
    ["двадцать семь","二十七"],
    ["двадцать восемь","二十八"],
    ["двадцать девять","二十九"],
    ["тридцать","三十"],
    ["тридцать один","三十一"]
  ];

  document.getElementById('russian').innerHTML = days[day][0]+" "+numbers[numb][0]+" "+months[month][0];
  document.getElementById('chinese').innerHTML = days[day][1]+numbers[numb][1]+months[month][1];
  document.getElementById('date').innerHTML = numb+"/"+month+"/2017";
//})();
